<?php
/**
 * Created by PhpStorm.
 * User: zsp
 * Date: 2017/12/10
 * Time: 下午8:47
 */

$allInfo = StockList::readAllRecord();

$fav = [];

$fav[] = [
    'title'   => '大盘',
    'symbols' => [
        'sh000001',
        'sz399001',
    ],
];

$fav[] = [
    'title'   => '银行',
    'symbols' => [
        'sz000001',
        'sh601398',
        'sh601939',
        'sh600036',
        'sh601166',
    ],
];

$fav[] = [
    'title'   => '保险',
    'symbols' => [
        'sh601318',
        'sh601336',
        'sh601601',
        'sh601628',
    ],
];

$fav[] = [
    'title'   => '民航机场',
    'symbols' => [
        'sh601111',
        'sh600115',
        'sh600029',
        'sh600009',
        'sh600004',
    ],
];

$fav[] = [
    'title'   => '房地产',
    'symbols' => [
        'sz000002',
        'sh600048',
        'sh600340',
        'sh600606',
    ],
];

$fav[] = [
    'title'   => '钢铁',
    'symbols' => [
        'sh600019',
        'sz000898',
        'sz000709',
        'sh600808',
        'sh600782',
    ],
];

$fav[] = [
    'title'   => '煤炭石化',
    'symbols' => [
        'sh601857',
        'sh600028',
        'sh601088',
    ],
];

$fav[] = [
    'title'   => '水泥建材',
    'symbols' => [
        'sh600585',
        'sh600801',
        'sz000786',
        'sz000672',
    ],
];
$fav[] = [
    'title'   => '工程建设',
    'symbols' => [
        'sh601668',
        'sh601800',
        'sh601390',
        'sh601186',
    ],
];

$fav[] = [
    'title'   => '玻璃陶瓷',
    'symbols' => [
        'sh601636',
        'sz000012',
        'sh600660',
        'sh600176',
    ],
];

$fav[] = [
    'title'   => '造纸印刷',
    'symbols' => [
        'sz000488',
        'sz002078',
        'sh600567',
        'sz002511',
    ],
];

$fav[] = [
    'title'   => '新能源',
    'symbols' => [
        'sz002202',
        'sh601558',
    ],
];

$fav[] = [
    'title'   => '医药制造',
    'symbols' => [
        'sh600196',
        'sh600276',
        'sz002019',
        'sh600518',
    ],
];
/*
$fav[] = [
    'title'   => '医疗行业',
    'symbols' => [
        'sz002223',
        'sh603233',
        'sh600090',
        'sh600763',
    ],
];
*/
$fav[] = [
    'title'   => '化工',
    'symbols' => [
        'sh600309',
        'sh601216',
        'sh600352',
        'sz002601',
    ],
];
$fav[] = [
    'title'   => '农牧饲渔',
    'symbols' => [
        'sz002311',
        'sh600438',
        'sz002714',
        'sz300498',
        'sz000876',
    ],
];

$fav[] = [
    'title'   => '电子信息',
    'symbols' => [
        'sz002354',
        'sz002027',
        'sz002624',
        'sz002555',
        'sz002195',
    ],
];

$fav[] = [
    'title'   => '电子元件',
    'symbols' => [
        'sz000725',
        'sz002456',
        'sz002008',
        'sz002475',
//        'sh600703',
    ],
];

$fav[] = [
    'title'   => '汽车',
    'symbols' => [
        'sz002594',
        'sh600104',
        'sh601238',
//        'sh600066',
    ],
];
$fav[] = [
    'title'   => '机械行业',
    'symbols' => [
        'sh600031',
        'sz000425',
        'sz000528',
        'sz000157',
        'sz000338',
        'sh601985',
    ],
];

/*
$fav[] = [
    'title'   => '交运物流',
    'symbols' => [
        'sh601006',
        'sh600787',
        'sz002352',
        'sh600153',
    ],
];
*/
/*
$fav[] = [
    'title'   => '',
    'symbols' => [
        '',
        '',
        '',
        '',
    ],
];
*/
